; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain zenotravel)
;(:requirements :typing :fluents)
(:types locatable city - object
  aircraft person - locatable)
(:predicates (located ?x - locatable  ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
      (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (located ?p ?c)
                 (located ?a ?c))
 :effect (and (not (located ?p ?c))
              (in ?p ?a)
    (increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (located ?a ?c))
 :effect (and (not (in ?p ?a))
              (located ?p ?c)
    (decrease (onboard ?a) 1)))

(:action fly-slow
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a)
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))

(:action fly-fast
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (located ?a ?c1)
                 (>= (fuel ?a)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (located ?a ?c1))
              (located ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
  )
)

(:action refuel
 :parameters (?a - aircraft)
 :precondition (and (> (capacity ?a) (fuel ?a))

    )
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2-2c)
(:domain zenotravel)
(:objects
  plane1 - aircraft
  person1 - person
  person2 - person
  city0 - city
  city1 - city
  )
(:init
  (located plane1 city0)
  (= (capacity plane1) 6000)
  (= (fuel plane1) 4000)
  (= (slow-burn plane1) 3)
  (= (fast-burn plane1) 12)
  (= (onboard plane1) 0)
  (= (zoom-limit plane1) 6)
  (located person1 city0)
  (located person2 city1)
  (= (distance city0 city0) 0)
  (= (distance city0 city1) 500)
  (= (distance city1 city0) 500)
  (= (distance city1 city1) 0)
  (= (total-fuel-used) 0)
)
(:goal (and
  (located person1 city1)
  (located person2 city0)
  ))
(:metric minimize (total-fuel-used))
)

; plan
1. (board person1 plane1 city0)
   deleted: (located person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 0 of 2
2. (fly-slow plane1 city0 city1)
   deleted: (located plane1 city0)
   added: (located plane1 city1)
   changed: (total-fuel-used) from 0 to 1500, (fuel plane1) from 4000 to 2500
   goals met: 0 of 2
3. (board person2 plane1 city1)
   deleted: (located person2 city1)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 0 of 2
4. (fly-slow plane1 city1 city0)
   deleted: (located plane1 city1)
   added: (located plane1 city0)
   changed: (total-fuel-used) from 1500 to 3000, (fuel plane1) from 2500 to 1000
   goals met: 0 of 2
5. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (located person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 1 of 2
6. (refuel plane1)
   changed: (fuel plane1) from 1000 to 6000
   goals met: 1 of 2
7. (fly-slow plane1 city0 city1)
   deleted: (located plane1 city0)
   added: (located plane1 city1)
   changed: (total-fuel-used) from 3000 to 4500, (fuel plane1) from 6000 to 4500
   goals met: 1 of 2
8. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (located person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 2
